from os import environ, getenv

from dotenv import find_dotenv, load_dotenv

load_dotenv(find_dotenv())

BOT_TOKEN = environ.get('BOT_TOKEN', 'define bot token!')

OPENAI_API_KEY = getenv('OPENAI_API_KEY')

VOICE_RELATIVE_DIR = 'data/files/voices'

BUTTON_NEW_TEXT = 'Почати нову розмову'

START_TEXT = ('✌️ Привіт!\n\n'
              'Мене звуть ШТУ - це скорочення від "Штучний Інтелект '
              'з України". Я - мовний асистент і готовий до '
              'спілкування з тобою.\nЯ здатний зрозуміти як текстові, '
              'так і голосові повідомлення.\n\nРозпочнемо нашу нову розмову?')

HELP_TEXT = ('Вітаю! Я - штучний інтелект з України (ШТУ), '
             'з яким ви можете спілкуватися, використовуючи низку '
             'команд нашого телеграм бота. Ви можете надсилати мені текстові '
             'і голосові повідомлення - я здатний їх зрозуміти.\n\n'
             'Ось список кількох команд, за допомогою яких ви можете '
             'користуватися моїми послугами:\n\n'
             '1. /start - Ця команда дозволяє запустити телеграм бота '
             'та почати спілкування зі мною.\n\n'
             '2. /new - Якщо ви хочете запустити новий діалог зі мною, '
             'скористайтеся цією командою.\n\n'
             '3. /help - Якщо вам потрібна допомога, скористайтеся цією командою. '
             'Я надам вам інформацію щодо всіх доступних команд та допоможу '
             'зрозуміти, як їх використовувати.\n\n'
             'Також хочу додати, що команда /new або ж кнопка "Почати нову розмову" '
             'дозволяють запустити новий діалог '
             'зі мною, якщо вам потрібно обговорити інші питання чи запитання. '
             'Коли ви використовуєте команду /new або кнопку "Почати нову розмову", '
             'бот відкриває новий діалог, '
             'а попередній забувається. <b>Я рекомендую використовувати команду '
             '/new або кнопку "Почати нову розмову", якщо ви хочете почати '
             'обговорення іншої теми чи задати нові запитання.</b>\n\n'
             'Якщо у вас є додаткові запитання, не соромтеся звертатися '
             'до мене за допомогою. Я завжди готовий допомогти вам знайти '
             'відповідь на ваші запитання!')


NEW_TEXT = ('👌 Готовий до нової бесіди!\n\n'
            'ℹ️ Нагадую, що я можу розуміти як текстові, '
            'так і голосові повідомлення.')
